xdu-aero-association/FM33LC0XX_Example_0.04/LPTIM 定时/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_i2c.h
/**
  * @brief    
  * @rmtoll   MSPTOR    TIMEOUT    LL_I2C_MasterMode_Get_SlaveSCL_TimeOut
  * @param    I2Cx I2C instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_I2C_MasterMode_Get_SlaveSCL_TimeOut(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->MSPTOR, 0xfffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SCLSEN    LL_I2C_SlaveMode_EnableSCLStretching
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnableSCLStretching(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPCR, I2C_SSPCR_SCLSEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SCLSEN    LL_I2C_SlaveMode_IsEnabled_SCLStretching
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabled_SCLStretching(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPCR, I2C_SSPCR_SCLSEN_Msk) == I2C_SSPCR_SCLSEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SCLSEN    LL_I2C_SlaveMode_Disable_SCLStretching
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Disable_SCLStretching(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPCR, I2C_SSPCR_SCLSEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SSP_DMAEN    LL_I2C_SlaveMode_Enable_DAM
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Enable_DAM(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPCR, I2C_SSPCR_SSP_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SSP_DMAEN    LL_I2C_SlaveMode_IsEnabled_DAM
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabled_DAM(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPCR, I2C_SSPCR_SSP_DMAEN_Msk) == I2C_SSPCR_SSP_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SSP_DMAEN    LL_I2C_SlaveMode_Disable_DAM
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Disable_DAM(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPCR, I2C_SSPCR_SSP_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    ACKEN    LL_I2C_SlaveMode_Enable_ACK_Respond
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Enable_ACK_Respond(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPCR, I2C_SSPCR_ACKEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    ACKEN    LL_I2C_SlaveMode_IsEnabled_ACK_Respond
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabled_ACK_Respond(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPCR, I2C_SSPCR_ACKEN_Msk) == I2C_SSPCR_ACKEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    ACKEN    LL_I2C_SlaveMode_Disable_ACK_Respond
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Disable_ACK_Respond(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPCR, I2C_SSPCR_ACKEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SDAO_DLYEN    LL_I2C_SlaveMode_Enable_SDAStretching
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Enable_SDAStretching(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPCR, I2C_SSPCR_SDAO_DLYEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SDAO_DLYEN    LL_I2C_SlaveMode_IsEnabled_SDAStretching
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabled_SDAStretching(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPCR, I2C_SSPCR_SDAO_DLYEN_Msk) == I2C_SSPCR_SDAO_DLYEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SDAO_DLYEN    LL_I2C_SlaveMode_Disable_SDAStretching
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Disable_SDAStretching(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPCR, I2C_SSPCR_SDAO_DLYEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SCLI_ANFEN    LL_I2C_SlaveMode_Enable_SCLAnalogFilter
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Enable_SCLAnalogFilter(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPCR, I2C_SSPCR_SCLI_ANFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SCLI_ANFEN    LL_I2C_SlaveMode_IsEnabled_SCLAnalogFilter
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabled_SCLAnalogFilter(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPCR, I2C_SSPCR_SCLI_ANFEN_Msk) == I2C_SSPCR_SCLI_ANFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SCLI_ANFEN    LL_I2C_SlaveMode_Disable_SCLAnalogFilter
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Disable_SCLAnalogFilter(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPCR, I2C_SSPCR_SCLI_ANFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    A10EN    LL_I2C_SlaveMode_Enable_ADDR10Bit
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Enable_ADDR10Bit(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPCR, I2C_SSPCR_A10EN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    A10EN    LL_I2C_SlaveMode_IsEnabled_ADDR10Bit
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabled_ADDR10Bit(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPCR, I2C_SSPCR_A10EN_Msk) == I2C_SSPCR_A10EN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    A10EN    LL_I2C_SlaveMode_Disable_ADDR10Bit
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Disable_ADDR10Bit(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPCR, I2C_SSPCR_A10EN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SSPEN    LL_I2C_SlaveMode_Enable
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Enable(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPCR, I2C_SSPCR_SSPEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SSPEN    LL_I2C_SlaveMode_IsEnabled
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabled(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPCR, I2C_SSPCR_SSPEN_Msk) == I2C_SSPCR_SSPEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPCR    SSPEN    LL_I2C_SlaveMode_Disable
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Disable(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPCR, I2C_SSPCR_SSPEN_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    ADEE    LL_I2C_SlaveMode_EnabledIT_AddrError
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_AddrError(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_ADEE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    ADEE    LL_I2C_SlaveMode_IsEnabledIT_AddrError
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_AddrError(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_ADEE_Msk) == I2C_SSPIER_ADEE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    ADEE    LL_I2C_SlaveMode_DisableIT_AddrError
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_AddrError(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_ADEE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    SE    LL_I2C_SlaveMode_EnabledIT_Start
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_Start(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_SE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    SE    LL_I2C_SlaveMode_IsEnabledIT_Start
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_Start(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_SE_Msk) == I2C_SSPIER_SE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    SE    LL_I2C_SlaveMode_DisableIT_Start
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_Start(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_SE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    PE    LL_I2C_SlaveMode_EnabledIT_Stop
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_Stop(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_PE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    PE    LL_I2C_SlaveMode_IsEnabledIT_Stop
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_Stop(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_PE_Msk) == I2C_SSPIER_PE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    PE    LL_I2C_SlaveMode_DisableIT_Stop
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_Stop(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_PE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    WCOLE    LL_I2C_SlaveMode_EnabledIT_WriteConflict
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_WriteConflict(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_WCOLE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    WCOLE    LL_I2C_SlaveMode_IsEnabledIT_WriteConflict
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_WriteConflict(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_WCOLE_Msk) == I2C_SSPIER_WCOLE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    WCOLE    LL_I2C_SlaveMode_DisableIT_WriteConflict
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_WriteConflict(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_WCOLE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    SSPOVE    LL_I2C_SlaveMode_EnabledIT_BuffOverFlow
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_BuffOverFlow(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_SSPOVE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    SSPOVE    LL_I2C_SlaveMode_IsEnabledIT_BuffOverFlow
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_BuffOverFlow(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_SSPOVE_Msk) == I2C_SSPIER_SSPOVE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    SSPOVE    LL_I2C_SlaveMode_DisableIT_BuffOverFlow
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_BuffOverFlow(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_SSPOVE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    ADME    LL_I2C_SlaveMode_EnabledIT_AddrMatched
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_AddrMatched(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_ADME_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    ADME    LL_I2C_SlaveMode_IsEnabledIT_AddrMatched
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_AddrMatched(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_ADME_Msk) == I2C_SSPIER_ADME_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    ADME    LL_I2C_SlaveMode_DisableIT_AddrMatched
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_AddrMatched(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_ADME_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    TXIE    LL_I2C_SlaveMode_EnabledIT_TransmitCompleted
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_TransmitCompleted(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_TXIE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    TXIE    LL_I2C_SlaveMode_IsEnabledIT_TransmitCompleted
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_TransmitCompleted(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_TXIE_Msk) == I2C_SSPIER_TXIE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    TXIE    LL_I2C_SlaveMode_DisableIT_TransmitCompleted
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_TransmitCompleted(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_TXIE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    RXIE    LL_I2C_SlaveMode_EnabledIT_ReceiveCompleted
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_EnabledIT_ReceiveCompleted(I2C_Type* I2Cx)
{
    SET_BIT(I2Cx->SSPIER, I2C_SSPIER_RXIE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    RXIE    LL_I2C_SlaveMode_IsEnabledIT_ReceiveCompleted
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsEnabledIT_ReceiveCompleted(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPIER, I2C_SSPIER_RXIE_Msk) == I2C_SSPIER_RXIE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPIER    RXIE    LL_I2C_SlaveMode_DisableIT_ReceiveCompleted
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_DisableIT_ReceiveCompleted(I2C_Type* I2Cx)
{
    CLEAR_BIT(I2Cx->SSPIER, I2C_SSPIER_RXIE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPISR    ADE    LL_I2C_SlaveMode_IsActiveFlag_AddrError
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_AddrError(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_ADE_Msk) == (I2C_SSPISR_ADE_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    ADE    LL_I2C_SlaveMode_ClearFlag_AddrError
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_ClearFlag_AddrError(I2C_Type* I2Cx)
{
    WRITE_REG(I2Cx->SSPISR, I2C_SSPISR_ADE_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPISR    S    LL_I2C_SlaveMode_IsActiveFlag_Start
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_Start(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_S_Msk) == (I2C_SSPISR_S_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    S    LL_I2C_SlaveMode_ClearFlag_Start
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_ClearFlag_Start(I2C_Type* I2Cx)
{
    READ_REG(I2Cx->SSPISR); 
}

/**
  * @brief    
  * @rmtoll   SSPISR    P    LL_I2C_SlaveMode_IsActiveFlag_Stop
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_Stop(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_P_Msk) == (I2C_SSPISR_P_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    P    LL_I2C_SlaveMode_ClearFlag_WriteConflict
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_ClearFlag_WriteConflict(I2C_Type* I2Cx)
{
    READ_REG(I2Cx->SSPISR); 
}

/**
  * @brief    
  * @rmtoll   SSPISR    WCOL    LL_I2C_SlaveMode_IsActiveFlag_WriteConflict
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_WriteConflict(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_WCOL_Msk) == (I2C_SSPISR_WCOL_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    WCOL    LL_I2C_SlaveMode_ClearFlag_BuffOverFlow
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_ClearFlag_BuffOverFlow(I2C_Type* I2Cx)
{
    WRITE_REG(I2Cx->SSPISR, I2C_SSPISR_WCOL_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPISR    SSPOV    LL_I2C_SlaveMode_IsActiveFlag_BuffOverFlow
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_BuffOverFlow(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_SSPOV_Msk) == (I2C_SSPISR_SSPOV_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    ADM    LL_I2C_SlaveMode_IsActiveFlag_AddrMatched
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_AddrMatched(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_ADM_Msk) == (I2C_SSPISR_ADM_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    ADM    LL_I2C_SlaveMode_ClearFlag_AddrMatched
  * @param    I2Cx I2C instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void LL_I2C_SlaveMode_ClearFlag_AddrMatched(I2C_Type* I2Cx)
{
    WRITE_REG(I2Cx->SSPISR, I2C_SSPISR_ADM_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPISR    TXI    LL_I2C_SlaveMode_IsActiveFlag_TransmitCompleted
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_TransmitCompleted(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_TXI_Msk) == (I2C_SSPISR_TXI_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    TXI    LL_I2C_SlaveMode_ClearFlag_TransmitCompleted
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_ClearFlag_TransmitCompleted(I2C_Type* I2Cx)
{
    WRITE_REG(I2Cx->SSPISR, I2C_SSPISR_TXI_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPISR    RXI    LL_I2C_SlaveMode_IsActiveFlag_ReceiveCompleted
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_ReceiveCompleted(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPISR, I2C_SSPISR_RXI_Msk) == (I2C_SSPISR_RXI_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPISR    RXI    LL_I2C_SlaveMode_ClearFlag_ReceiveCompleted
  * @param    I2Cx I2C instance
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_ClearFlag_ReceiveCompleted(I2C_Type* I2Cx)
{
    WRITE_REG(I2Cx->SSPISR, I2C_SSPISR_RXI_Msk);
}

/**
  * @brief    
  * @rmtoll   SSPSR    BUSY    LL_I2C_SlaveMode_IsActiveFlag_Busy
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_IsActiveFlag_Busy(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPSR, I2C_SSPSR_BUSY_Msk) == (I2C_SSPSR_BUSY_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPSR    RW    LL_I2C_SlaveMode_Get_DataDirection
  * @param    I2Cx I2C instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_I2C_SSP_DATA_DIRECTION_SLAVE_TO_MASTER
  *           @arg @ref LL_I2C_SSP_DATA_DIRECTION_MASTER_TO_SLAVE
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_Get_DataDirection(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPSR, I2C_SSPSR_RW_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPSR    DA    LL_I2C_SlaveMode_Get_DataType
  * @param    I2Cx I2C instance
  * @param    I2Cx I2C instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_I2C_SSP_DATA_TYPE_DATA
  *           @arg @ref LL_I2C_SSP_DATA_TYPE_ADDR
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_Get_DataType(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPSR, I2C_SSPSR_DA_Msk));
}

/**
  * @brief    
  * @rmtoll   SSPBUF        LL_I2C_SlaveMode_WriteDataBuff
  * @param    I2Cx I2C instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_WriteDataBuff(I2C_Type* I2Cx, uint32_t data)
{
    MODIFY_REG(I2Cx->SSPBUF, (0xffU << 0U), (data << 0U));
}

/**
  * @brief    
  * @rmtoll   SSPBUF        LL_I2C_SlaveMode_ReadDataBuff
  * @param    I2Cx I2C instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_ReadDataBuff(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPBUF, 0xffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   SSPADR        LL_I2C_SlaveMode_Set_SlaveAddr
  * @param    I2Cx I2C instance
  * @param    addr 
  * @retval   None
  */
__STATIC_INLINE void LL_I2C_SlaveMode_Set_SlaveAddr(I2C_Type* I2Cx, uint32_t addr)
{
    MODIFY_REG(I2Cx->SSPADR, (0x3ffU << 0U), (addr << 0U));
}

/**
  * @brief    
  * @rmtoll   SSPADR        LL_I2C_SlaveMode_Get_SlaveAddr
  * @param    I2Cx I2C instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_I2C_SlaveMode_Get_SlaveAddr(I2C_Type* I2Cx)
{
    return (uint32_t)(READ_BIT(I2Cx->SSPADR, 0x3ffU) >> 0U);
}

/**
  * @}
  */

/** @defgroup I2C_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_I2C_DeInit(I2C_Type *I2Cx);
void LL_I2C_SlaveMode_StructInit(LL_I2C_SlaveMode_InitTypeDef *I2C_InitStruct);
void LL_I2C_MasterMode_StructInit(LL_I2C_MasterMode_InitTypeDef *I2C_InitStruct);
ErrorStatus LL_I2C_SlaveMode_Init(I2C_Type *I2cx, LL_I2C_SlaveMode_InitTypeDef *I2C_InitStruct);
ErrorStatus LL_I2C_MasterMode_Init(I2C_Type *I2Cx, LL_I2C_MasterMode_InitTypeDef *I2C_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_I2C_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-15**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
